tutorials/Tube/Tube/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform 300.0;
    }

    outlet
    {
         type            zeroGradient;
    }

    tube
    {
        type           fixedValue;
        value          uniform 301.0;
    }
    front
    {
        type            wedge;     
    }
    back
    {
        type            wedge;  
    }
    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
